/*
	Создайте 3 переменных ( x = 6, y = 14, z =4 ) Выполните и отобразите результат следующих операций для этих переменных:
		x += y - x++ * z ;
		z = --x - y * 5 ;
		y /= x + 5 % z;
		z - x++ + y * 5;
		x = y - x++ * z;
	Дайте ответ как джаваскрипт выполнил расчет каждой операции.
*/

var x = 6, y = 14, z = 4;
var answer = x += y - x++ * z;
var x = 6, y = 14, z = 4;
var answerWithBrakets = (x += (y - ((x++) * z)));
/*
	1. Постфіксисний декремент
	2. Множенння
	3. Віднімання
	4. Присвоювання з додаванням
*/
if(answer == answerWithBrakets)
	document.write("Відповідь: "+ answer + " Перевірка вірна!", "<br/>");
else alert("Перевірка не вірна!", "<br/>");
//===============================================================================
var x = 6, y = 14, z = 4;
var answer = z = --x - y * 5;
var x = 6, y = 14, z = 4;
var answerWithBrakets = (z = ((--x) - (y * 5)));
/*
	1. Передсуфіксисний декремент
	2. Множенння
	3. Віднімання
	4. Присвоювання
*/
if(answer == answerWithBrakets)
	document.write("Відповідь: "+ answer + " Перевірка вірна!", "<br/>");
else alert("Перевірка не вірна!", "<br/>");
//===============================================================================
var x = 6, y = 14, z = 4;
var answer = y /= x + 5 % z;
var x = 6, y = 14, z = 4;
var answerWithBrakets = (y /= (x + (5 % z)));
/*
	1. Остача від ділення
	2. Додавання
	3. Ділення з присвоюванням
*/
if(answer == answerWithBrakets)
	document.write("Відповідь: "+ answer + " Перевірка вірна!", "<br/>");
else alert("Перевірка не вірна!", "<br/>");
//===============================================================================
var x = 6, y = 14, z = 4;
var answer = z - x++ + y * 5;
var x = 6, y = 14, z = 4;
var answerWithBrakets = ((z - (x++)) + (y * 5));
/*
	1. Постфіксисний декремент
	2. Множення
	3. Віднімання
	4. Додавання
*/
if(answer == answerWithBrakets)
	document.write("Відповідь: "+ answer + " Перевірка вірна!", "<br/>");
else alert("Перевірка не вірна!", "<br/>");
//===============================================================================
var x = 6, y = 14, z = 4;
var answer = x = y - x++ * z;
var x = 6, y = 14, z = 4;
var answerWithBrakets = (x = (y - ((x++) * z)));
/*
	1. Постфіксисний декремент
	2. Множення
	3. Віднімання
	4. Додавання
*/
if(answer == answerWithBrakets)
	document.write("Відповідь: "+ answer + " Перевірка вірна!", "<br/>");
else alert("Перевірка не вірна!", "<br/>");